blog-posts/2004-02-24-todl-variation-on-lisp-for-cyborgs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>TODL, variation on LISP for cyborgs</title>
<!-- 2015-01-07 Wed 14:47 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">TODL, variation on LISP for cyborgs</h1>
<p>
February 24th, 2004 -
<a href="http://sachachua.com/blog/p/1768"><a href="http://sachachua.com/blog/p/1768">http://sachachua.com/blog/p/1768</a></a>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">From</td>
<td class="left">Joe Corneli (<a href="mailto:jcorneli@math.utexas.edu">jcorneli@math.utexas.edu</a>)</td>
</tr>

<tr>
<td class="left">Subject</td>
<td class="left">Re: displaying one character per line.</td>
</tr>

<tr>
<td class="left">To</td>
<td class="left">help-gnu-emacs (<a href="mailto:help-gnu-emacs@gnu.org">help-gnu-emacs@gnu.org</a>)</td>
</tr>

<tr>
<td class="left">Date</td>
<td class="left">Tue Feb 24 03:47:55 2004 +0800</td>
</tr>
</tbody>
</table>

<blockquote>
<p>
I want to be able to switch between different list views of a
 document. For example, one might want to look at a text document as
 a list of characters, a list of words, a list of phonemes, a list
 (tree) of syntactic clauses, a list of sentences, or a list of topic
 sentences that link to paragraphs, etc. Characters just happen to be
 the simplest.
</p>
</blockquote>

<blockquote>
<p>
This is part of designing a mode I call todl-mode (for TODo List).
 TODL is a variation on LISP specially designed for cyborgs :). The
 idea is that if you can switch between different list views and add
 hyperlinks to elements of each view, you will have a very powerful
 tool for processing information.
</p>
</blockquote>

<blockquote>
<p>
I think of it as being somewhere in between lisp-mode,
 emacs-wiki-mode, and something like outline-mode. It should be
 possible to implement a TODL variant for any kind of code (so
 todl-mode is also something like font-lock-mode).
</p>
</blockquote>

<p>
E-Mail from Joe Corneli
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
